import { Box, Typography } from "@mui/material";

export const Private_1 = () => {
  return (
    <Box sx={{ mb: 2 }}>
      <Typography
        variant="subtitle2"
        sx={{ fontWeight: 600, marginBottom: 1.5 }}
        // className="text-white"
      >
        欢迎您来到趣代码世界。
        请您仔细阅读以下条款，如果您未满18周岁，请在法定监护人的陪同下阅读本协议。如果您对本协议的任何条款表示异议，您可以选择不进入趣代码世界（即“社区”或“平台”）。无论是您进入平台，还是注册成功，或是在平台上发布任何内容（即“内容”），均意味着您（即“用户”）完全接受本协议项下的全部条款。
        一.总则
        1.趣代码世界是安徽天才罗宝教育科技有限公司（即“平台方”或“我们”）向用户提供的信息存储空间，为用户提供信息分享、传播、获取及为用户创作创意作品提供技术与内容支持的开放社区平台。
        2.用户通过平台发表的信息为公开的信息，第三方均可以通过平台获取用户发表的信息，用户对任何信息的发表即认可该信息为公开的信息，并单独对此行为承担法律责任；任何用户不愿被第三人获知的信息都不应该在平台上进行发表。
        3.用户应当根据本协议以及平台不时更新和公布的其他社区规则使用平台服务。我们有权对用户使用平台的情况进行审查、监督和管理，如用户在使用平台时违反本协议及社区规则，我们或经我们授权的人有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户张贴的内容，限制、暂停或终止用户使用平台的权利）以减轻用户不当行为造成的影响。
        4.我们在法律允许的范围内对本协议享有解释权。
      </Typography>
    </Box>
  );
};
